{
  "backend/main.mo": "Defines the backend canister with user, business, subscription, reward, and access-control data models and storage maps, plus role/block checks and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping product features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files related to UI states, admin tools, customer pages, and seller dashboards.",
  "frontend/index.css": "Tailwind-based global styles defining color variables, dark mode values, and base component styling.",
  "frontend/index.html": "Main HTML entry point for the PWA with manifest links, icons, splash images, and script bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and display behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page prompting users to reconnect or retry.",
  "frontend/public/sw.js": "Service worker implementing app-shell caching, offline fallback routing, and cache cleanup.",
  "frontend/src/App.tsx": "Main React router setup defining routes for admin, seller, and customer areas with auth, role, and approval guards.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with navigation back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects a user's name and saves their profile via mutation.",
  "frontend/src/components/auth/RequireApproval.tsx": "Wrapper that redirects unapproved non-admin users and shows a loading spinner during approval checks.",
  "frontend/src/components/auth/RequireAuth.tsx": "Guards routes by checking authentication status and redirecting unauthenticated users.",
  "frontend/src/components/auth/RequireRole.tsx": "Role-based access guard that checks user roles and renders an access denied screen if unauthorized.",
  "frontend/src/components/business/BusinessCard.tsx": "Displays a business's name, address, and unlock badge with optional verified indicator.",
  "frontend/src/components/business/VerifiedBadge.tsx": "Shows a styled badge with a check icon indicating verified status.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying disclaimer text and a credit link with dynamic year and host.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing full-height structure with main content and footer.",
  "frontend/src/config/unlock.ts": "Defines unlock duration and pricing config and provides a helper to compute duration in nanoseconds.",
  "frontend/src/constants/legal.ts": "Exports the app's disclaimer text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor instance, invalidating queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Aggregates identity, profile, role, admin, and approval state into a unified auth hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, roles, admin checks, approvals, and business profile operations.",
  "frontend/src/index.css": "Tailwind base setup defining light/dark theme CSS variables and global styles.",
  "frontend/src/lib/StateScreens.tsx": "Reusable loading, error, empty, and success screen components with icons and optional actions.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Admin/AdminLayout.tsx": "Admin layout with navigation tabs and outlet for nested admin pages.",
  "frontend/src/pages/Admin/CityCategoryManager.tsx": "UI stubs for managing cities and categories, pending backend CRUD support.",
  "frontend/src/pages/Admin/KycDashboard.tsx": "Displays pending KYC submissions and allows admins to approve or reject them.",
  "frontend/src/pages/Admin/Reports.tsx": "Stub page for viewing customer reports, awaiting backend implementation.",
  "frontend/src/pages/Admin/RevenueTracker.tsx": "Shows token, subscription, and total revenue using fetched statistics.",
  "frontend/src/pages/Admin/RoleAssignment.tsx": "Basic UI for viewing and managing user role assignments.",
  "frontend/src/pages/Admin/UserApprovals.tsx": "Lists seller approval requests and lets admins approve or reject them.",
  "frontend/src/pages/Admin/UserManagement.tsx": "Allows blocking/unblocking users and blocking by manual principal input.",
  "frontend/src/pages/AuthGate.tsx": "Routes authenticated users based on role and handles profile setup and PWA install prompt.",
  "frontend/src/pages/Customer/BusinessDetail.tsx": "Displays business info and allows customers to unlock full details by purchasing access, then navigates to a confirmation screen.",
  "frontend/src/pages/Customer/CustomerLayout.tsx": "Provides the main customer layout with header, login, and tab navigation for search, history, rewards, and QR scan pages.",
  "frontend/src/pages/Customer/QRScan.tsx": "Placeholder screen for QR code scanning, describing upcoming scanner integration.",
  "frontend/src/pages/Customer/ReportHelp.tsx": "Form for customers to submit issue reports about a business, currently storing data locally and navigating back.",
  "frontend/src/pages/Customer/RewardsWallet.tsx": "Shows total reward points, QR scan actions, and a history of earned rewards fetched from the backend.",
  "frontend/src/pages/Customer/Search.tsx": "Search page that lists businesses with filtering by name and navigation to business details.",
  "frontend/src/pages/Customer/UnlockConfirm.tsx": "Confirmation page displayed after unlocking a business, including a disclaimer and return button.",
  "frontend/src/pages/Customer/UnlockHistory.tsx": "Displays the user's history of business unlocks with timestamps and active/expired status.",
  "frontend/src/pages/OfflineFallback.tsx": "Offline fallback screen prompting users to reconnect and retry loading the app.",
  "frontend/src/pages/Seller/Analytics.tsx": "Seller analytics dashboard showing unlock counts, revenue, and filterable time ranges.",
  "frontend/src/pages/Seller/ApprovalStatus.tsx": "Displays seller approval status and provides a button to request approval if pending.",
  "frontend/src/pages/Seller/BusinessProfileEditor.tsx": "Form page for creating or editing the seller’s business profile using query hooks and validation.",
  "frontend/src/pages/Seller/KycPortal.tsx": "Displays the seller’s KYC status with icons and badges, with future document upload planned.",
  "frontend/src/pages/Seller/LeadDashboard.tsx": "Fetches and lists seller leads, showing timestamps and expiry status with loading and error states.",
  "frontend/src/pages/Seller/QrCode.tsx": "Generates and displays a QR code linking to the seller’s business page using an external QR API.",
  "frontend/src/pages/Seller/SellerLayout.tsx": "Layout wrapper for seller pages providing tab navigation and header with login.",
  "frontend/src/pages/Seller/Subscription.tsx": "Shows subscription status, expiry date, and allows renewing via a mutation hook.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker in production after window load.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, containers, and plugins.",
  "project_state.json": "Defines project metadata for the BHARATcnt PWA, including versioning, architectural notes, required images, and a list of existing features for Admin, Seller, and User modules. Contains no code but outlines planned functionality such as authentication, KYC, dashboards, subscriptions, and unlock flows."
}